florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
// ---- Audio event tracking ----
static uint8_t  lastAudioSystemState = 0;     // detect state transitions for error alert
static bool     batteryLowPlayed  = false;     // one-shot for battery warning
static bool     batteryCritPlayed = false;     // one-shot for battery critical
static constexpr uint16_t BATTERY_LOW_THRESHOLD_RAW = 2000;  // 20.00 V in 0.01 V units
static constexpr uint16_t BATTERY_CRIT_THRESHOLD_RAW = 1800; // 18.00 V in 0.01 V units
static unsigned long lastObstacleWarnMs = 0;   // debounce obstacle warning beeps
static constexpr unsigned long OBSTACLE_WARN_INTERVAL_MS = 2000;

// ---- Runtime counter for maintenance tracking ----
static unsigned long lastRuntimeUpdateMs = 0;
static constexpr unsigned long RUNTIME_UPDATE_INTERVAL_MS = 60000;  // update every 60 s
static bool     maintenanceWarnPlayed = false;

// ---- Temperature audio tracking ----
static bool     tempHighPlayed = false;        // one-shot for temp high warning
static constexpr int8_t TEMP_HIGH_THRESHOLD = 85;  // °C — play alert above this
static constexpr int8_t TEMP_HIGH_HYSTERESIS = 5;  // °C — hysteresis to prevent oscillation

// ---- ABS/TCS audio tracking ----
static uint8_t  lastAbsActive = 0;
static uint8_t  lastTcsActive = 0;

// ---- Overcurrent audio tracking ----
static uint8_t  lastSafetyError = 0;           // last SafetyError code for transition detect

// ---- Lights audio tracking ----
static bool     lastFrontRelayOn  = false;
static bool     lastRearRelayOn   = false;
static bool     lightsAudioInit   = false;     // skip first transition on startup

// ---- Multi-error burst arbitration ----
// When >1 error/warning fires within the burst window, play the highest-severity
// sound instead of collapsing to ERROR_GENERAL (Phase 1 AUDIO_MITIGATION_PLAN).
// Severity order: EMERGENCY > OVERCURRENT > BATTERY_CRITICAL > SENSOR errors > ERROR_GENERAL
static uint8_t  errorBurstCount = 0;
static unsigned long errorBurstStartMs = 0;
static constexpr unsigned long ERROR_BURST_WINDOW_MS = 2000;  // 2 s window
static constexpr uint8_t ERROR_BURST_THRESHOLD = 2;           // >=2 errors = burst
static audio::Sound    burstDominantSound = audio::Sound::ERROR_GENERAL;
static audio::Priority burstDominantPri   = audio::Priority::HI;

/// Burst severity ranking — higher value = more important for the driver.
/// Determines which sound wins when multiple errors fire within the burst window.
static uint8_t burstSeverity(audio::Sound s) {
    switch (s) {
        case audio::Sound::EMERGENCY:            return 6;
        case audio::Sound::OVERCURRENT:          return 5;
        case audio::Sound::BATTERY_CRITICAL:     return 4;
        case audio::Sound::SENSOR_TEMP_ERROR:    return 3;
        case audio::Sound::SENSOR_CURRENT_ERROR: return 3;
        case audio::Sound::SENSOR_SPEED_ERROR:   return 3;
        case audio::Sound::ENCODER_ERROR:        return 3;
        case audio::Sound::TEMP_HIGH:            return 3;
        case audio::Sound::BATTERY_LOW:          return 2;
        case audio::Sound::OBSTACLE_WARN:        return 2;
        case audio::Sound::ERROR_GENERAL:        return 1;
        default:                                 return 0;
    }
}

// ---- LED brake/reverse detection thresholds ----
// Speed sum threshold: 4 wheels × 0.5 km/h × 10 (0.1 km/h units) = 20
static constexpr uint32_t LED_SPEED_SUM_THRESHOLD = 20;
// Traction average below which we consider braking (0–100% scale)
static constexpr uint8_t LED_TRACTION_BRAKING_THRESHOLD = 5;

// ---- NVS flush interval ----
static unsigned long lastNvsFlushMs = 0;
static constexpr unsigned long NVS_FLUSH_INTERVAL_MS = 10000;  // 10 seconds

// ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
// Detect whether the STM32 alive counter (heartbeat byte 0) is actually
// incrementing.  A frozen STM32 (IWDG not kicking, or timer firing without
// the main loop running) would keep sending the same counter value.
// After STM32_HB_FREEZE_COUNT consecutive identical counter values the ESP32
// considers the STM32 non-responsive and inhibits further motion commands.
static constexpr uint8_t  STM32_HB_FREEZE_COUNT = 5;   // 5 × 100 ms = 500 ms
static uint8_t  stm32HbLastCounter   = 0xFFU;           // Init to impossible value
static uint8_t  stm32HbSameCount     = 0;
static bool     stm32IsAlive         = false;

// ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
// When the STM32 restarts it re-initialises to GEAR_FORWARD regardless of
// what gear the ESP32 (or driver) had selected.  The ESP32 detects the restart
// via the startup_inhibit bit (bit 0 of heartbeat statusFlags) transitioning
// from 0→1, sets a flag, and re-sends the current physical shifter gear as soon
// as the inhibit clears and the STM32 enters ACTIVE state.
static bool     stm32StartupSeen     = false;  // true while startup_inhibit was last 1
static bool     gearResyncPending    = false;  // true = need to re-send gear on ACTIVE

// ---- Render task (Core 0) — offloads TFT + touch from main loop ----
static SemaphoreHandle_t vdMutex = nullptr;
static vehicle::VehicleData renderVD;  // shared copy for render task
static QueueHandle_t touchActionQueue = nullptr;

enum class TouchAction : uint8_t {
    FRONT_LED_TOGGLE,
    REAR_LED_TOGGLE,
    TANK_MODE_TOGGLE,
};

// ---- Command ACK tracking (Phase 13) ----
// Non-blocking: records when a command was sent and checks for ACK arrival.
// UI state is only updated once ACK is received or timeout expires.
// Design: no automatic retry — bounded timeout only, no infinite loops.

static bool     ackPending     = false;   // true while waiting for ACK
static uint8_t  ackExpectedCmd = 0;       // low byte of the command CAN ID we sent
static unsigned long ackSentMs = 0;       // timestamp when the command was sent
static bool     ackTimedOut    = false;   // set true if ACK_TIMEOUT_MS elapsed

/// Call before sending a command that expects ACK (CMD_MODE, SERVICE_CMD).
__attribute__((unused))
static void ackBeginWait(uint8_t cmdIdLow) {
    ackPending     = true;
    ackExpectedCmd = cmdIdLow;
    ackSentMs      = millis();
    ackTimedOut    = false;
}

/// Call from loop() after can_rx::poll() to check for ACK arrival or timeout.
static void ackCheck(vehicle::VehicleData& data) {
    if (!ackPending) return;

