florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Check if matching ACK arrived
    const auto& ad = data.ack();
    if (ad.timestampMs >= ackSentMs && ad.cmdIdLow == ackExpectedCmd) {
        ackPending  = false;
        ackTimedOut = false;
        if (ad.result != can::AckResult::OK) {
            Serial.printf("[ACK] cmd 0x%02X result=%u state=%u\n",
                          ad.cmdIdLow, static_cast<uint8_t>(ad.result),
                          static_cast<uint8_t>(ad.systemState));
        }
        return;
    }

    // Check timeout (bounded, no retry loop)
    if (millis() - ackSentMs >= can::ACK_TIMEOUT_MS) {
        ackPending  = false;
        ackTimedOut = true;
        data.setAckTimeout(millis());
        Serial.printf("[ACK] TIMEOUT waiting for cmd 0x%02X\n", ackExpectedCmd);
    }
}

/// Send LED relay command to STM32 via CAN 0x120.
/// @param front  true = turn on front relay, false = turn off
/// @param rear   true = turn on rear relay,  false = turn off
static void sendLedCommand(bool front, bool rear) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_LED;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = front ? 1 : 0;
    frame.data[1]          = rear  ? 1 : 0;
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_LED & 0xFF);  // Low byte of 0x120 = 0x20
}

/// Send gear change command to STM32 via CAN 0x102 (CMD_MODE).
/// @param gear  Gear value (0=P, 1=R, 2=N, 3=D1, 4=D2)
static void sendGearCommand(uint8_t gear) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_MODE;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = currentModeFlags;  // Include current mode flags
    frame.data[1]          = gear;
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_MODE & 0xFF);  // Low byte of 0x102 = 0x02
}

/// Send drive mode command to STM32 via CAN 0x102 (CMD_MODE).
/// @param modeFlags  Mode flags byte (bit 0 = 4x4, bit 1 = tank turn)
static void sendModeCommand(uint8_t modeFlags) {
    CanFrame frame = {};
    frame.identifier       = can::CMD_MODE;
    frame.extd             = 0;
    frame.data_length_code = 2;
    frame.data[0]          = modeFlags;
    frame.data[1]          = shifter::getGearRaw();  // Include current gear
    ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    ackBeginWait(can::CMD_MODE & 0xFF);
}

// ---------------------------------------------------------------------------
// renderTask() — FreeRTOS task pinned to Core 0
//
// Handles all TFT display and touch operations, keeping the main loop()
// on Core 1 free for CAN, sensors, audio, and LEDs without SPI blocking.
// The TFT SPI bus (~28 ms per frame) no longer stalls CAN polling or
// safety-critical processing.
//
// FRAME LATCH ARCHITECTURE (deterministic render):
//   1. Acquire mutex → copy renderVD into localVD (frozen snapshot)
//   2. Pass localVD to screenManager.update(localVD):
//      a. screen.update(localVD) copies data into cur_* members
//      b. frameLimiter gates screen.draw() to 20 FPS
//      c. screen.draw() reads only from cur_*/prev_* — NOT from localVD
//   3. Result: each rendered frame represents a single, consistent time instant
//      Even if CAN updates arrive mid-render, the displayed frame is atomic.
// ---------------------------------------------------------------------------
static void renderTask(void* /*param*/) {
    vehicle::VehicleData localVD;

    for (;;) {
        // 1. Copy latest vehicle data from main loop
        if (xSemaphoreTake(vdMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            localVD = renderVD;
            xSemaphoreGive(vdMutex);
        }

        // 2. Update & render screen (frame limiter inside screenManager)
        lastFrameStart = millis();
        screenManager.update(localVD);

        // 3. Runtime overlay on boot screen only
        {
            uint32_t frameTime = millis() - lastFrameStart;
            if (showOverlay && screenManager.isInitialScreen()) {
                draw_runtime_overlay(tft, frameTime);
            } else {
                showOverlay = false;
            }
        }

        // 4. Centralized touch handling (same SPI bus as TFT)
        {
            uint16_t tx = 0, ty = 0;
            bool isTouched = tft.getTouch(&tx, &ty);
            touch::update(isTouched, static_cast<int16_t>(tx),
                          static_cast<int16_t>(ty));

            touch::TouchEvent evt = touch::getEvent();

            if (evt.type == touch::EventType::LONG_PRESS) {
                screenManager.onLongPress(evt.x, evt.y);
            }

            if (evt.type == touch::EventType::TAP) {
                screenManager.onTouch(evt.x, evt.y);

                if (!screenManager.isBlockingInput()) {
                    // ---- Tank turn confirmation dialog active ----
                    // If the confirm bar is visible, route ALL taps to it first.
                    if (screenManager.isTankConfirmActive()) {
                        uint8_t confirmResult = screenManager.handleTankConfirmTouch(evt.x, evt.y);
                        if (confirmResult == 1) {
                            // User confirmed YES → queue the actual toggle
                            TouchAction act = TouchAction::TANK_MODE_TOGGLE;
                            xQueueSend(touchActionQueue, &act, 0);
                        }
                        // confirmResult 2 = NO (dismissed), 0 = consumed
                        // In all cases, skip normal touch handling this frame
                    } else {
                        // Normal touch handling (no confirm dialog)
                        if (ui::LedToggle::hitTestFront(evt.x, evt.y)) {
                            TouchAction act = TouchAction::FRONT_LED_TOGGLE;
                            xQueueSend(touchActionQueue, &act, 0);
                        }
                        if (ui::LedToggle::hitTestRear(evt.x, evt.y)) {
                            TouchAction act = TouchAction::REAR_LED_TOGGLE;
                            xQueueSend(touchActionQueue, &act, 0);
                        }
                        uint8_t modeHit = ui::ModeIcons::hitTest(evt.x, evt.y);
                        if (modeHit == 3) {
                            // Show confirmation dialog instead of immediate toggle
                            screenManager.showTankConfirm();
                        }
                    }
                }
            }

#if RUNTIME_MONITOR
            // Debug overlay toggle (3 s hold) and draw
            // Uses lastFrameStart (captured once per frame at line 367)
            // to comply with frame time contract — no direct millis() in UI.
            RTMON_OVERLAY_UPDATE(isTouched, lastFrameStart);
            RTMON_OVERLAY_DRAW(tft, lastFrameStart);
#endif
        }

        vTaskDelay(1);  // yield to other Core 0 tasks (WiFi, BT, etc.)
    }
}

// ---------------------------------------------------------------------------
// twaiInit() — (re-)install and start the TWAI driver with project timing.
//
// Returns true on success.  Called from setup() for the initial bring-up and
// from the error-passive recovery path when the controller is stuck with
// TEC ≥ 128 but never reaches bus-off.
// ---------------------------------------------------------------------------
static bool twaiInit() {
    twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(
        static_cast<gpio_num_t>(CAN_TX_PIN),
        static_cast<gpio_num_t>(CAN_RX_PIN),
        TWAI_MODE_NORMAL);
    g_config.rx_queue_len = 5;
    g_config.tx_queue_len = 5;

    /* Start from the standard 500 kbps macro so that clk_src (and
     * quanta_resolution_hz on ESP-IDF ≥ 5.x) are initialised to the
     * correct platform defaults.  The previous memset(&t_config,0,...)
     * zeroed clk_src, which is NOT TWAI_CLK_SRC_DEFAULT on ESP-IDF 5.x
     * — causing twai_driver_install() to fail or to select the wrong
     * clock, producing a baud-rate mismatch with the STM32 FDCAN.
     *
     * We then override brp/tseg/sjw to achieve an 87.5 % sample point
     * (CiA 301 recommended) that closely matches the STM32's 88.2 %. */
    twai_timing_config_t t_config = TWAI_TIMING_CONFIG_500KBITS();

    /* CRITICAL FIX: On ESP-IDF ≥ 5.0, TWAI_TIMING_CONFIG_500KBITS()
     * sets quanta_resolution_hz = 10 000 000 (10 MHz) with brp = 0.
     * When quanta_resolution_hz > 0, twai_driver_install() calculates:
     *   brp = APB_CLK / quanta_resolution_hz = 80 MHz / 10 MHz = 8
     * This produces:
     *   bit time = (1+13+2) × 8/80 MHz = 1600 ns → 625 kbps
     *
     * The STM32 FDCAN is configured for 500 kbps (170 MHz / 10 / 34).
     * A 25 % baud-rate mismatch makes communication IMPOSSIBLE — every
     * frame fails bit-level validation (stuff/CRC errors, no ACKs).
     *
     * Fix: clear quanta_resolution_hz so the driver uses the manually
     * specified brp = 10 directly:
     *   bit time = (1+13+2) × 10/80 MHz = 2000 ns → 500 kbps  ✓
     *
     * The clk_src field (set by the macro) is preserved, ensuring the
     * correct APB clock source is selected on all ESP-IDF versions.   */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    t_config.quanta_resolution_hz = 0;
#endif
    t_config.brp            = 10;
    t_config.tseg_1         = 13;
    t_config.tseg_2         = 2;
    t_config.sjw            = 2;
    t_config.triple_sampling = false;

