florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

    if (twai_driver_install(&g_config, &t_config, &f_config) != ESP_OK) {
        return false;
    }
    if (twai_start() != ESP_OK) {
        twai_driver_uninstall();
        return false;
    }
    return true;
}

// ---------------------------------------------------------------------------
// setup() — called once at power-on
// ---------------------------------------------------------------------------
void setup() {
    Serial.setTxBufferSize(512);   // Prevent Serial.printf() blocking on long diagnostics
    Serial.begin(115200);
    delay(500);
    psram_diagnostic();

    // Reset cause reporting
    esp_reset_reason_t reason = esp_reset_reason();
    Serial.printf("[BOOT][INFO] Reset reason: %s\n",
        reason == ESP_RST_POWERON  ? "PowerOn" :
        reason == ESP_RST_SW       ? "Software" :
        reason == ESP_RST_PANIC    ? "Panic" :
        reason == ESP_RST_INT_WDT  ? "Watchdog(INT)" :
        reason == ESP_RST_TASK_WDT ? "Watchdog(TASK)" :
        reason == ESP_RST_WDT      ? "Watchdog(OTHER)" :
        reason == ESP_RST_BROWNOUT ? "Brownout" :
        reason == ESP_RST_SDIO     ? "SDIO" :
        reason == ESP_RST_DEEPSLEEP ? "DeepSleep" :
                                      "Unknown");

    Serial.println("[BOOT][INFO] ESP32 HMI CAN bring-up booted");

    // Initialize NVS config store
    config_store::init();

    // Initialize PSRAM
    if (psramInit()) {
        // Give system a moment to complete PSRAM initialization
        delay(10);
        Serial.printf("[BOOT][INFO] PSRAM initialized — total: %u bytes, free: %u bytes\n",
                      (unsigned)ESP.getPsramSize(), (unsigned)ESP.getFreePsram());
    } else {
        Serial.println("[BOOT][ERR] PSRAM initialization FAILED — check board_build.arduino.memory_type");
        // Consider halting or entering degraded mode if PSRAM is required
        // while(1) { delay(1000); }
    }

    // Initialize TFT display
    tft.init();
    tft.setRotation(1);  // Landscape mode (480×320)

    // Apply touch calibration (XPT2046) — values from User_Setup.h
    // Run TFT_eSPI/examples/Generic/Touch_calibrate to get your own values.
    uint16_t calData[5] = TOUCH_CALIBRATION;
    tft.setTouch(calData);

    tft.fillScreen(0x2104);  // Dark gray background
    tft.setTextColor(0xFFFF, 0x2104);
    tft.setTextSize(1);
    Serial.println("[BOOT][INFO] Display initialized (480x320 landscape)");

    /* ---- TWAI initialization with CiA 301 optimal timing ----
     *
     * The ESP32-TWAI-CAN library default 500 kbps timing uses a sample
     * point of 80.0 % (BRP=8, TSEG1=15, TSEG2=4).  The STM32 FDCAN is
     * configured at 88.2 %.  The 8.2 % difference is right at the limit
     * of what SJW can compensate — combined with the STM32's HSI ±1 %
     * clock tolerance, this causes persistent BERR / ACK errors.
     *
     * Fix: use custom timing with 87.5 % sample point (CiA 301
     * recommended for 500 kbps), closely matching the STM32's 88.2 %.
     *
     * APB clock  = 80 MHz
     * BRP        = 10    → TQ = 10 / 80 MHz = 125 ns
     * Bit time   = 1 (sync) + 13 (seg1) + 2 (seg2) = 16 TQ = 2 µs
     * Baud rate  = 80 MHz / 10 / 16 = 500 kbps
     * Sample pt  = (1 + 13) / 16 = 87.5 %
     * SJW        = 2  → ±12.5 % oscillator tolerance                  */
    if (twaiInit()) {
        Serial.printf("[CAN][INFO] Initialized at 500 kbps (SP=87.5%%, BRP=10, "
                      "TSEG1=13, TSEG2=2, SJW=2)\n");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
        Serial.printf("[CAN][INFO] ESP-IDF %d.%d.%d — quanta_resolution_hz cleared "
                      "to force BRP mode\n",
                      ESP_IDF_VERSION_MAJOR, ESP_IDF_VERSION_MINOR,
                      ESP_IDF_VERSION_PATCH);
#endif
    } else {
        Serial.println("[CAN][ERR] Initialization FAILED");
    }

    // Initialize obstacle sensor driver (TF-Mini Plus on UART1, GPIO 18)
    //   RX = GPIO 18 (sensor TX → ESP32 RX, 3.3V TTL direct connection)
    //   TX = NOT CONNECTED (sensor RX not wired to ESP32 TX)
    //
    // READ-ONLY MODE: The sensor's RX pin is not connected to the ESP32's
    // TX, so no configuration commands can reach the sensor.
    // Config defaults are selected at compile time based on SENSOR_TYPE.
    {
        obstacle_sensor::Config obsCfg;
        obsCfg.txPin = -1;   // TX not connected — read-only
        obstacle_sensor::init(obsCfg);
    }

    // Initialize CAN TX for obstacle distance frame (0x208)
    can_obstacle::init();

    // Initialize WS2812B LED controller (front GPIO 47 + rear GPIO 48)
    led_ctrl::init();

    // Initialize power manager (ignition key on GPIO 40/41)
    power_mgr::init();

    // Initialize DFPlayer audio (UART2 on GPIO 43/44)
    audio::init();

    // Initialize MCP23017 shifter input (I2C on GPIO 8/9)
    shifter::init();

    // Initialize traction switch (DPDT rocker on GPIO 15)
    traction_sw::init();

    // Initialize centralized touch handler
    touch::init();

    // Apply saved configuration
    {
        const auto& cfg = config_store::get();
        // Traction mode is now read from physical switch, not NVS
        currentModeFlags   = traction_sw::getModeFlag()
                           | (cfg.driveMode & can::MODE_FLAG_TANK_TURN);
        frontLedLocalState = cfg.frontLedEnabled;
        rearLedLocalState  = cfg.rearLedEnabled;

        // Apply saved audio volume to DFPlayer
        audio::setVolume(cfg.audioVolume);

        // Populate vehicleData with initial mode flags
        vehicle::ModeData md;
        md.modeFlags   = currentModeFlags;
        md.timestampMs = millis();
        vehicleData.setMode(md);
    }

    // Create render task on Core 0 — offloads all TFT and touch operations
    // from the main loop, preventing SPI blocking on Core 1.
    vdMutex = xSemaphoreCreateMutex();
    touchActionQueue = xQueueCreate(8, sizeof(TouchAction));
    if (vdMutex == nullptr || touchActionQueue == nullptr) {
        Serial.println("[BOOT][ERR] Failed to create render task resources");
        // Fall through — render task won't be created, TFT won't update.
        // System is still safe (CAN, safety, LEDs continue on Core 1).
    } else {
        BaseType_t rc = xTaskCreatePinnedToCore(
            renderTask, "Render", 16384, nullptr, 1, nullptr, 0);
        if (rc != pdPASS) {
            Serial.println("[BOOT][ERR] Failed to create render task");
        } else {
            Serial.println("[BOOT][INFO] Render task started on Core 0");
        }
    }
}

// ---------------------------------------------------------------------------
// loop() — called repeatedly
// ---------------------------------------------------------------------------
void loop() {
    RTMON_LOOP_BEGIN();
    unsigned long now = millis();

    // Poll CAN RX and decode incoming frames
    RTMON_CAN_BEGIN();
    can_rx::poll(vehicleData);
    RTMON_CAN_END();

    // Check for pending ACK (non-blocking)
    ackCheck(vehicleData);

    // ---- Sync mode flags from STM32 heartbeat echo ----
    // The STM32 echoes the active mode flags in the heartbeat status_flags
    // (bits 1-2).  This allows the ESP32 to confirm the STM32 actually
    // applied the requested mode, even if the ACK was lost.
    // Guard: only sync after first valid heartbeat has been received
    // (timestampMs is 0 until the first CAN heartbeat is decoded).
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t confirmedFlags = (hb.statusFlags >> 1) & 0x03;
            if (confirmedFlags != currentModeFlags) {
                currentModeFlags = confirmedFlags;
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
            }
        }
    }

