florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
    // Verify the STM32 alive counter is incrementing each heartbeat period.
    // A frozen STM32 (timer ISR alive but main loop stuck) would send the same
    // counter value indefinitely — treat it as non-responsive after the freeze
    // threshold and inhibit further motion commands from this node.
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t counter = hb.aliveCounter;
            if (counter != stm32HbLastCounter) {
                stm32HbLastCounter = counter;
                stm32HbSameCount   = 0;
                stm32IsAlive       = true;
            } else {
                if (stm32HbSameCount < STM32_HB_FREEZE_COUNT) {
                    stm32HbSameCount++;
                }
                stm32IsAlive = (stm32HbSameCount < STM32_HB_FREEZE_COUNT);
                if (!stm32IsAlive) {
                    Serial.println("[SAFETY][WARN] STM32 heartbeat counter frozen — inhibiting commands");
                }
            }

            // ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
            // Detect startup_inhibit bit (statusFlags bit 0): 0→1 = STM32 just restarted.
            // When the bit later clears (0) AND state is ACTIVE, re-send the current gear
            // so the STM32 and shifter are synchronised.  Guards against the default
            // GEAR_FORWARD mis-match if the driver had previously selected PARK or REVERSE.
            bool startupInhibitNow = (hb.statusFlags & 0x01u) != 0;
            if (startupInhibitNow && !stm32StartupSeen) {
                // Rising edge of startup_inhibit → STM32 just booted/reset
                stm32StartupSeen  = true;
                gearResyncPending = true;
                Serial.println("[SAFETY][INFO] STM32 restart detected — gear resync pending");
            }
            if (gearResyncPending && !startupInhibitNow &&
                hb.systemState == can::SystemState::ACTIVE && stm32IsAlive) {
                // STM32 is now in ACTIVE with no startup inhibit — send current gear
                uint8_t curGear = shifter::getGearRaw();
                sendGearCommand(curGear);
                lastSentGear    = curGear;  // prevent duplicate send from shifter loop
                gearResyncPending = false;
                Serial.printf("[SAFETY][INFO] Gear resync sent: gear=%u\n", curGear);
            }
            if (!startupInhibitNow) {
                stm32StartupSeen = false;  // inhibit cleared, ready for next detection
            }
        }
    }

    // Update obstacle sensor and transmit CAN 0x208
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t speedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            speedSum += vehicleData.speed().raw[i];
        }
        float speedKmh = static_cast<float>(speedSum) / 4.0f * 0.1f;
        obstacle_sensor::update(speedKmh);
        can_obstacle::update();

        // Update VehicleData with latest sensor reading for HMI display.
        // distanceCm = 0 maps to "---" in the UI, signalling no valid reading.
        // Use 0 when the sensor is unhealthy (fault/stuck/timeout) so the
        // display shows "---" instead of a misleading "0.02 m" fallback value.
        obstacle_sensor::Reading rd = obstacle_sensor::getReading();
        vehicle::ObstacleData od;
        od.distanceCm  = rd.healthy ? (rd.distance_mm / 10) : 0;
        od.timestampMs  = millis();
        vehicleData.setObstacle(od);
    }

    // ---- Update shared vehicle data for render task (Core 0) ----
    // Non-blocking: skip if render task holds the mutex (stale-by-one-frame is OK).
    if (vdMutex != nullptr && xSemaphoreTake(vdMutex, 0) == pdTRUE) {
        renderVD = vehicleData;
        xSemaphoreGive(vdMutex);
    }

    // ---- Shifter gear update ----
    // Poll MCP23017, send CAN 0x102 on gear change.
    // SAFETY FIX: Gate gear commands on STM32 liveness.  If the STM32
    // heartbeat counter is frozen the vehicle controller is not responsive;
    // sending gear changes to a non-responding node could cause stale
    // commands to execute when the node recovers.
    {
        shifter::update();
        uint8_t gear = shifter::getGearRaw();
        if (gear != lastSentGear &&
            (now - lastGearSendMs) >= GEAR_SEND_DEBOUNCE_MS &&
            stm32IsAlive) {
            lastSentGear   = gear;
            lastGearSendMs = now;
            sendGearCommand(gear);
            // Play specific gear announcement
            switch (static_cast<shifter::Gear>(gear)) {
                case shifter::Gear::PARK:       audio::play(audio::Sound::GEAR_PARK,    audio::Priority::LO); break;
                case shifter::Gear::REVERSE:    audio::play(audio::Sound::GEAR_REVERSE, audio::Priority::LO); break;
                case shifter::Gear::NEUTRAL:    audio::play(audio::Sound::GEAR_NEUTRAL, audio::Priority::LO); break;
                case shifter::Gear::FORWARD:    audio::play(audio::Sound::GEAR_D1,      audio::Priority::LO); break;
                case shifter::Gear::FORWARD_D2: audio::play(audio::Sound::GEAR_D2,      audio::Priority::LO); break;
            }
            Serial.printf("[SHIFTER] Gear → %u\n", gear);
        }
    }

    // ---- Traction switch update ----
    // Poll DPDT rocker switch for 2WD/4WD selection.
    // CAN CMD_MODE is sent only when the switch state changes.
    // Speed gate is handled internally by traction_sw::update().
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t swSpeedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            swSpeedSum += vehicleData.speed().raw[i];
        }
        float swSpeedKmh = static_cast<float>(swSpeedSum) / 4.0f * 0.1f;

        traction_sw::update(swSpeedKmh);

        if (traction_sw::hasChanged() && stm32IsAlive) {
            // Update mode flags: preserve tank turn bit, set 4x4 from switch
            uint8_t tractionBit = traction_sw::getModeFlag();
            currentModeFlags = (currentModeFlags & can::MODE_FLAG_TANK_TURN)
                             | tractionBit;
            sendModeCommand(currentModeFlags);
            // Only persist tank turn to NVS; traction comes from physical switch
            config_store::setDriveMode(currentModeFlags & can::MODE_FLAG_TANK_TURN);
            {
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
            }
            // Play traction audio feedback
            if (traction_sw::is4WD()) {
                audio::play(audio::Sound::TRACTION_4X4, audio::Priority::LO);
            } else {
                audio::play(audio::Sound::TRACTION_4X2, audio::Priority::LO);
            }
            Serial.printf("[TRACTION] Switch → %s, flags=0x%02X\n",
                          traction_sw::is4WD() ? "4WD" : "2WD",
                          currentModeFlags);
            traction_sw::clearChanged();
        }
    }

    // ---- Process touch actions from render task (Core 0) ----
    // Touch reading and screen dispatch happen on Core 0 (same SPI bus as TFT).
    // Actions that require CAN sends or state changes are queued here.
    if (touchActionQueue != nullptr) {
        TouchAction act;
        while (xQueueReceive(touchActionQueue, &act, 0) == pdTRUE) {
            switch (act) {
                case TouchAction::FRONT_LED_TOGGLE:
                    frontLedLocalState = !frontLedLocalState;
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    config_store::setFrontLedEnabled(frontLedLocalState);
                    audio::play(frontLedLocalState ? audio::Sound::LIGHTS_ON
                                                   : audio::Sound::LIGHTS_OFF,
                                audio::Priority::LO);
                    Serial.printf("[LED] Front → %s\n",
                                  frontLedLocalState ? "ON" : "OFF");
                    break;

