florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // ---- Runtime counter for maintenance tracking ----
    // Accumulate seconds only when system is in ACTIVE/DEGRADED/LIMP_HOME states
    // (vehicle is actually being operated, not just powered on in BOOT/STANDBY).
    {
        auto sysState = vehicleData.heartbeat().systemState;
        bool isOperating = (sysState == can::SystemState::ACTIVE ||
                            sysState == can::SystemState::DEGRADED ||
                            sysState == can::SystemState::LIMP_HOME);
        if (isOperating && (now - lastRuntimeUpdateMs) >= RUNTIME_UPDATE_INTERVAL_MS) {
            // Use a fixed increment (60 s) to avoid precision loss from integer division
            constexpr uint32_t RUNTIME_INCREMENT_SEC = RUNTIME_UPDATE_INTERVAL_MS / 1000;
            uint32_t cur = config_store::get().runtimeSeconds;
            config_store::setRuntimeSeconds(cur + RUNTIME_INCREMENT_SEC);
            lastRuntimeUpdateMs = now;
        } else if (!isOperating) {
            lastRuntimeUpdateMs = now;  // Reset so we don't accumulate standby time
        }

        // Play maintenance reminder once per power cycle when threshold crossed
        if (config_store::isMaintenanceDue() && !maintenanceWarnPlayed &&
            !config_store::get().maintAcknowledged) {
            // Use ERROR_GENERAL sound as maintenance reminder (no dedicated track)
            audio::play(audio::Sound::TEST_SYSTEM, audio::Priority::LO);
            maintenanceWarnPlayed = true;
            Serial.println("[MAINT] Maintenance reminder — service due");
        }
    }

    // ---- WS2812B LED update ----
    {
        auto st = vehicleData.heartbeat().systemState;
        bool frontEnabled = vehicleData.lights().frontRelayOn;

        // Enable/disable LED system based on front relay and system state
        // (front relay controls the WS2812B power for decorative effects)
        if (!frontEnabled || st == can::SystemState::BOOT || st == can::SystemState::STANDBY) {
            led_ctrl::setEnabled(false);
        } else {
            led_ctrl::setEnabled(true);
        }

        // Reverse detection from physical shifter
        bool reverse = (shifter::getGearRaw() == GEAR_REVERSE);

        // Braking & throttle detection: traction average near zero while
        // speed > 0 indicates dynamic braking or throttle release at speed.
        bool braking = false;
        float throttlePct;
        {
            uint32_t trSum = 0;
            for (uint8_t i = 0; i < 4; ++i) {
                trSum += vehicleData.traction().scale[i];
            }
            uint8_t trAvg = static_cast<uint8_t>(trSum / 4);
            throttlePct = static_cast<float>(trAvg);

            uint32_t spSum = 0;
            for (uint8_t i = 0; i < 4; ++i) {
                spSum += vehicleData.speed().raw[i];
            }
            braking = (spSum > LED_SPEED_SUM_THRESHOLD && trAvg <= LED_TRACTION_BRAKING_THRESHOLD);
        }

        // ---- Front LED mode from vehicle state ----
        if (st == can::SystemState::SAFE || st == can::SystemState::ERROR) {
            led_ctrl::startEmergencyFlash(5);
        } else if (st == can::SystemState::LIMP_HOME) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::KITT_IDLE);
        } else if (vehicleData.safety().absActive) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::ABS_ALERT);
        } else if (vehicleData.safety().tcsActive) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::TCS_ALERT);
        } else if (reverse) {
            led_ctrl::setFrontMode(led_ctrl::FrontMode::REVERSE);
        } else {
            // Throttle-reactive front patterns
            led_ctrl::setFrontFromThrottle(throttlePct);
        }

        // ---- Rear LED mode from driving state ----
        if (st == can::SystemState::SAFE || st == can::SystemState::ERROR) {
            led_ctrl::setRearMode(led_ctrl::RearMode::BRAKE_EMERGENCY);
        } else if (reverse) {
            led_ctrl::setRearMode(led_ctrl::RearMode::REVERSE);
        } else if (braking) {
            led_ctrl::setRearMode(led_ctrl::RearMode::BRAKE);
        } else {
            led_ctrl::setRearMode(led_ctrl::RearMode::POSITION);
        }

        // ---- Turn-signal derivation from steering angle (0.1° units) ----
        // Activate at 15° to signal the beginning of a turn.
        // Deactivate at 10° (5° hysteresis) to avoid flickering when the
        // wheel hovers around the threshold.
        // SAFE/ERROR states override with hazard flash.
        {
            static constexpr int16_t TURN_ON_RAW  = 150;  // 15.0° — activate
            static constexpr int16_t TURN_OFF_RAW = 100;  // 10.0° — deactivate (hysteresis)

            int16_t angle = vehicleData.steering().angleRaw;
            static led_ctrl::TurnSignal prevTurn = led_ctrl::TurnSignal::OFF;

            led_ctrl::TurnSignal turn = prevTurn;  // start from last state

            if (st == can::SystemState::SAFE || st == can::SystemState::ERROR) {
                turn = led_ctrl::TurnSignal::HAZARD;
                // Don't persist HAZARD into prevTurn — reset to OFF so that
                // when the system recovers, the hysteresis starts clean.
                prevTurn = led_ctrl::TurnSignal::OFF;
                led_ctrl::setTurnSignal(turn);
            } else {
                if (angle < -TURN_ON_RAW) {
                    turn = led_ctrl::TurnSignal::LEFT;
                } else if (angle > TURN_ON_RAW) {
                    turn = led_ctrl::TurnSignal::RIGHT;
                } else if (angle > -TURN_OFF_RAW && angle < TURN_OFF_RAW) {
                    turn = led_ctrl::TurnSignal::OFF;
                }
                // Between OFF_RAW and ON_RAW: keep previous state (hysteresis band)

                prevTurn = turn;
                led_ctrl::setTurnSignal(turn);
            }
        }

        // Single update call drives all animation + FastLED.show()
        led_ctrl::update();
    }

    // Send heartbeat 0x011 every 100 ms
    if (now - lastHeartbeatMs >= can::HEARTBEAT_INTERVAL_MS) {
        lastHeartbeatMs = now;

        CanFrame frame = {};
        frame.identifier       = can::HEARTBEAT_ESP32;
        frame.extd             = 0;
        frame.data_length_code = 1;
        frame.data[0]          = heartbeatCounter++;

        ESP32Can.writeFrame(frame, 0);  // Non-blocking: drop if TX queue full
    }

    // Serial heartbeat every ~1 second
    if (now - lastSerialMs >= 1000) {
        lastSerialMs = now;
        Serial.println("[HMI] heartbeat");
    }

    // TWAI bus diagnostic — log error counters every 5 seconds
    if (now - lastCanDiagMs >= 5000) {
        lastCanDiagMs = now;
        twai_status_info_t status;
        if (twai_get_status_info(&status) == ESP_OK) {
            const char* stateStr = "UNKNOWN";
            switch (status.state) {
                case TWAI_STATE_STOPPED:    stateStr = "STOPPED";    break;
                case TWAI_STATE_RUNNING:    stateStr = "RUNNING";    break;
                case TWAI_STATE_BUS_OFF:    stateStr = "BUS_OFF";    break;
                case TWAI_STATE_RECOVERING: stateStr = "RECOVERING"; break;
            }
            Serial.printf("[CAN][DIAG] state=%s tx_err=%lu rx_err=%lu "
                          "tx_fail=%lu rx_miss=%lu arb_lost=%lu bus_err=%lu\n",
                          stateStr,
                          (unsigned long)status.tx_error_counter,
                          (unsigned long)status.rx_error_counter,
                          (unsigned long)status.tx_failed_count,
                          (unsigned long)status.rx_missed_count,
                          (unsigned long)status.arb_lost_count,
                          (unsigned long)status.bus_error_count);
            if (status.tx_error_counter >= 128 &&
                status.state == TWAI_STATE_RUNNING) {
                Serial.println("[CAN][WARN] Error-passive "
                               "(tx_err>=128). Check CAN bus wiring "
                               "and termination.");
            }
        }
    }

